# SQL - Subquery
    -> What is a Subquery?   
        A subquery is a query inside another query
        Example :-
        SELECT ...
        FROM ...
        WHERE column OPERATOR (SELECT ...);
        Also called Nested Query

    -> Why Subqueries are used ?
        You donâ€™t know the exact value
        The value depends on another query
        You want dynamic filtering

### Database Connection

In [9]:
%reload_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%sql mysql+pymysql://root:@localhost/test

In [11]:
%%sql
SELECT version();

 * mysql+pymysql://root:***@localhost/test
1 rows affected.

[('10.4.32-MariaDB',)]

### using Already Created table employees

In [16]:
%%sql
select * from employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[(101, 'Amit', 'IT', 60000, 25, 'Pune', datetime.date(2022, 6, 10)),
 (102, 'Neha', 'HR', 45000, 28, 'Mumbai', datetime.date(2021, 3, 15)),
 (103, 'Rahul', 'IT', 75000, 30, 'Pune', datetime.date(2020, 1, 20)),
 (104, 'Sneha', 'Finance', 50000, 26, 'Delhi', datetime.date(2022, 11, 5)),
 (105, 'Vikas', 'HR', 40000, 35, 'Mumbai', datetime.date(2019, 8, 12)),
 (106, 'Priya', 'IT', 85000, 29, 'Bangalore', datetime.date(2018, 4, 25)),
 (107, 'Arjun', 'Finance', 65000, 32, 'Pune', datetime.date(2020, 9, 18))]

## Types of Subqueries
    Single-row subquery	  ->  Returns ONE value
    Multiple-row subquery ->  Returns multiple values
    Subquery with IN      ->  Matches list of values
    Subquery with EXISTS  ->  Checks existence
    Correlated subquery	  ->  Depends on outer query

### Employee with highest salary

In [25]:
%%sql
select * from employees
where salary = (
    select max(salary) from employees
);

 * mysql+pymysql://root:***@localhost/test
1 rows affected.

[(106, 'Priya', 'IT', 85000, 29, 'Bangalore', datetime.date(2018, 4, 25))]

### Employees earning more than average salary

In [44]:
%%sql
select * from employees
where salary > (
    select avg(salary) from employees
);

 * mysql+pymysql://root:***@localhost/test
3 rows affected.

[(103, 'Rahul', 'IT', 75000, 30, 'Pune', datetime.date(2020, 1, 20)),
 (106, 'Priya', 'IT', 85000, 29, 'Bangalore', datetime.date(2018, 4, 25)),
 (107, 'Arjun', 'Finance', 65000, 32, 'Pune', datetime.date(2020, 9, 18))]

### Employees working in IT department

In [47]:
%%sql
select * from employees
where department in (
    select department from employees
    where department ='IT'
);

 * mysql+pymysql://root:***@localhost/test
3 rows affected.

[(101, 'Amit', 'IT', 60000, 25, 'Pune', datetime.date(2022, 6, 10)),
 (103, 'Rahul', 'IT', 75000, 30, 'Pune', datetime.date(2020, 1, 20)),
 (106, 'Priya', 'IT', 85000, 29, 'Bangalore', datetime.date(2018, 4, 25))]

### Departments having employees with salary > 60,000

In [52]:
%%sql
select distinct department from employees
where department in (
    select department from employees
    where salary > 60000
);

 * mysql+pymysql://root:***@localhost/test
2 rows affected.

[('IT',), ('Finance',)]

### Employee(s) with minimum salary

In [59]:
%%sql
select * from employees
where salary = (
    select min(salary) from employees
);

 * mysql+pymysql://root:***@localhost/test
1 rows affected.

[(105, 'Vikas', 'HR', 40000, 35, 'Mumbai', datetime.date(2019, 8, 12))]

### Using subquery in SELECT clause

In [78]:
%%sql
select emp_name, salary,
(select avg(salary) from employees) AS avg_salary
from employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[('Amit', 60000, Decimal('60000.0000')),
 ('Neha', 45000, Decimal('60000.0000')),
 ('Rahul', 75000, Decimal('60000.0000')),
 ('Sneha', 50000, Decimal('60000.0000')),
 ('Vikas', 40000, Decimal('60000.0000')),
 ('Priya', 85000, Decimal('60000.0000')),
 ('Arjun', 65000, Decimal('60000.0000'))]

### Find employees older than average age

In [103]:
%%sql
select emp_id, emp_name , age 
from employees
where age > (
    select avg(age) from employees
);

 * mysql+pymysql://root:***@localhost/test
3 rows affected.

[(103, 'Rahul', 30), (105, 'Vikas', 35), (107, 'Arjun', 32)]

### Find department(s) with highest average salary

In [126]:
%%sql
select distinct department, avg(salary) as avg_salary  from employees
order by avg_salary desc;

 * mysql+pymysql://root:***@localhost/test
1 rows affected.

[('IT', Decimal('60000.0000'))]

In [130]:
%%sql
SELECT department
FROM employees
GROUP BY department
HAVING AVG(salary) = (
    SELECT MAX(avg_sal)
    FROM (
        SELECT AVG(salary) AS avg_sal
        FROM employees
        GROUP BY department
    ) AS temp
);

 * mysql+pymysql://root:***@localhost/test
1 rows affected.

[('IT',)]

### Find employees not working in HR

In [145]:
%%sql
select * 
from employees
where department not in (
    select department from employees
    where department = 'HR'
);

 * mysql+pymysql://root:***@localhost/test
5 rows affected.

[(101, 'Amit', 'IT', 60000, 25, 'Pune', datetime.date(2022, 6, 10)),
 (103, 'Rahul', 'IT', 75000, 30, 'Pune', datetime.date(2020, 1, 20)),
 (104, 'Sneha', 'Finance', 50000, 26, 'Delhi', datetime.date(2022, 11, 5)),
 (106, 'Priya', 'IT', 85000, 29, 'Bangalore', datetime.date(2018, 4, 25)),
 (107, 'Arjun', 'Finance', 65000, 32, 'Pune', datetime.date(2020, 9, 18))]

In [141]:
%%sql
select * from employees
where department != 'HR'

 * mysql+pymysql://root:***@localhost/test
5 rows affected.

[(101, 'Amit', 'IT', 60000, 25, 'Pune', datetime.date(2022, 6, 10)),
 (103, 'Rahul', 'IT', 75000, 30, 'Pune', datetime.date(2020, 1, 20)),
 (104, 'Sneha', 'Finance', 50000, 26, 'Delhi', datetime.date(2022, 11, 5)),
 (106, 'Priya', 'IT', 85000, 29, 'Bangalore', datetime.date(2018, 4, 25)),
 (107, 'Arjun', 'Finance', 65000, 32, 'Pune', datetime.date(2020, 9, 18))]

### Employees whose salary equals department average

In [164]:
%%sql
select e.emp_name, e.salary, e.department 
from employees e
where salary = (
    select avg(e1.salary) from employees e1
    where e1.department = e.department
);

 * mysql+pymysql://root:***@localhost/test
0 rows affected.

[]